Repository: Ertoper/ColorMemorizer
Catalog: lib/l10n/app_*.arb
Languages: kk

# settingsTitle
source: Settings
kk: Баптаулар

source: Dark Mode
kk: Қараңғы режим

source: Language
kk: Тіл

source: English
kk: Ағылшын

source: Russian
kk: Орыс

source: Kazakh
kk: Қазақ

# playButton
source: Play
kk: Ойнау

# leaderboardButton
source: Leaderboard
kk: Көшбасшылар тақтасы

# levelSelectionPageTitle
source: Level Selection
kk: Деңгейді таңдау

# aboutPageTitle
source: About
kk: Қосымша туралы

# appDescription
source: Color Memorizer Game
kk: Түстерді есте сақтау ойыны

# credits
source: This mobile game challenges players to memorize a sequence of colors and reproduce it correctly across different levels. Developed by Tungatar Ersayyn and Roman Bushnyak in the scope of the course 'Crossplatform Development' at Astana IT University. Mentor (Teacher): Assistant Professor Abzal Kyzyrkanov
kk: Бұл мобильді ойын пайдаланушылардан түстер тізбегін есте сақтап, әр деңгейде дұрыс қайталауды талап етеді. Astana IT University-де «Кроссплатформалық әзірлеу» курсы аясында Тұңғатар Ерсайын мен Роман Бушняк әзірледі. Оқытушы: доцент Абзал Қызырканов

# leaderboardPageTitle
source: Leaderboard
kk: Көшбасшылар тақтасы

source: Your Rank
kk: Сіздің дәрежеңіз

source: Your Score
kk: Сіздің ұпайыңыз

# logoutButton
source: Logout
kk: Шығу

# logoutConfirmTitle
source: Confirm Logout
kk: Шығуды растау

# logoutConfirmMessage
source: Are you sure you want to log out?
kk: Сіз шынымен шығуды қалайсыз ба?

# cancelButton
source: Cancel
kk: Бас тарту

# accountTitle
source: Your Account
kk: Аккаунтыңыз

# loginTitle
source: Login
kk: Кіру

# emailLabel
source: Email
kk: Электрондық пошта

# emailRequired
source: Email is required
kk: Электрондық поштаны енгізіңіз

# emailInvalid
source: Please enter a valid email
kk: Дұрыс электрондық пошта енгізіңіз

# passwordLabel
source: Password
kk: Құпиясөз

# passwordRequired
source: Password is required
kk: Құпиясөзді енгізіңіз

# passwordTooShort
source: Password must be at least 6 characters
kk: Құпиясөз кемінде 6 таңбадан тұруы керек

# loginButton
source: Login
kk: Кіру

# loginFailed
source: Login failed. Please try again.
kk: Кіру сәтсіз аяқталды. Қайталап көріңіз.

# registerInstead
source: Don't have an account? Register
kk: Аккаунтыңыз жоқ па? Тіркеліңіз

# registerTitle
source: Register
kk: Тіркелу

# confirmPasswordLabel
source: Confirm Password
kk: Құпиясөзді растау

# confirmPasswordRequired
source: Please confirm your password
kk: Құпиясөзді растаңыз

# passwordsDontMatch
source: Passwords do not match
kk: Құпиясөздер сәйкес емес

# registrationFailed
source: Registration failed. Please try again.
kk: Тіркелу сәтсіз аяқталды. Қайталап көріңіз.

# registerButton
source: Register
kk: Тіркелу

# loginInstead
source: Already have an account? Login instead
kk: Тіркелгіңіз бар ма? Кіру

# watchSequence
source: Watch the sequence
kk: Реттілікті бақылаңыз

source: Your turn
kk: Сіздің кезегіңіз

# correctNextRound
source: Correct! Get ready for the next round!
kk: Дұрыс! Келесі раундқа дайын болыңыз!

# gameOver
source: Game Over! Try again.
kk: Ойын аяқталды! Қайта көріңіз.

source: Level
kk: Деңгей

# victory
source: Congratulations! You won!
kk: Құттықтаймыз! Сіз жеңдіңіз!

# emailAlreadyInUse
source: The email address is already in use by another account.
kk: Бұл электрондық пошта мекенжайы басқа тіркелгімен қолданылуда.

# passwordTooWeak
source: The password provided is too weak.
kk: Ұсынылған құпия сөз тым әлсіз.

# operationNotAllowed
source: Operation not allowed. Please contact support.
kk: Операцияға рұқсат етілмеген. Қолдау қызметіне хабарласыңыз.

# anUnexpectedErrorOccurred
source: An unexpected error occurred. Please try again.
kk: Күтпеген қате орын алды. Қайталап көріңіз.

source: Settings
kk: Параметрлер

source: About
kk: Қолданба туралы

source: Home
kk: Басты

# loginToAccessFeature
source: Please log in to access this feature.
kk: Бұл функцияға кіру үшін кіріңіз.

# loginFailedGeneric
source: Login failed. Please check your credentials and try again.
kk: Кіру сәтсіз аяқталды. Деректеріңізді тексеріп, қайталап көріңіз.

# userNotFound
source: No user found for that email.
kk: Бұл электрондық пошта үшін пайдаланушы табылмады.

# wrongPassword
source: Wrong password provided for that user.
kk: Бұл пайдаланушы үшін қате құпия сөз берілді.

# userDisabled
source: This user has been disabled.
kk: Бұл пайдаланушы өшірілген.

# tooManyRequests
source: Too many requests. Please try again later.
kk: Тыым көп сұраныстар. Кейінірек қайталап көріңіз.

source: Offline Mode
kk: Офлайн режим

# onlineStatus
source: Back Online!
kk: Қайта онлайн!

# offlineStatus
source: You are currently offline.
kk: Сіз қазір офлайнсыз.

# failedToLoadLeaderboard
source: Failed to load leaderboard. Showing local data.
kk: Көшбасшылар тақтасын жүктеу мүмкін болмады. Жергілікті деректер көрсетілуде.

# noLocalData
source: No local data available. Connect to internet to sync.
kk: Жергілікті деректер жоқ. Синхрондау үшін интернетке қосылыңыз.

# noLeaderboardData
source: No leaderboard data available yet. Play a game to submit your score!
kk: Көшбасшылар тақтасының деректері әлі жоқ. Ұпайыңызды жіберу үшін ойын ойнаңыз!

# syncButtonTooltip
source: Sync Data
kk: Деректерді синхрондау

source: Not in Top
kk: Топта емес

# levelSelectionTitle
source: Select Level
kk: Деңгейді таңдау

# simulateGameEnd
source: Simulate Game End and Submit Score:
kk: Ойынды аяқтауды және ұпайды жіберуді модельдеу:

# yourScoreHint
source: Your Score
kk: Сіздің ұпайыңыз

# submitScoreButton
source: Submit Score
kk: Ұпайды жіберу

# loginToSubmitScore
source: Please log in to submit a score.
kk: Ұпайды жіберу үшін кіріңіз.

source: Score submitted successfully!
kk: Ұпай сәтті жіберілді!

source: Failed to submit score.
kk: Ұпайды жіберу мүмкін болмады.

# startGamePlaceholder
source: Starting game...
kk: Ойын басталуда...

source: Play
kk: Ойнау

# aboutAppDescription
source: This is a simple color memorizer game designed to challenge your memory and concentration. Improve your cognitive skills by remembering color patterns and replaying them accurately.
kk: Бұл есте сақтау қабілетіңізді және зейініңізді сынауға арналған қарапайым түсті есте сақтау ойыны. Түсті үлгілерді есте сақтау және оларды дәл қайталау арқылы танымдық дағдыларыңызды жетілдіріңіз.

source: No internet connection.
kk: Интернет байланысы жоқ.

# internalError
source: Internal error occurred. Please try again.
kk: Ішкі қате орын алды. Қайта көріңізші.

source: Firebase error
kk: Firebase қатесі

# noInternetMessage
source: No internet connection
kk: Интернет байланысы жоқ

# endlessButton
source: Endless Game
kk: Шексіз ойын

source: Record
kk: Рекорд

source: Correct! Next level
kk: Дұрыс! Келесі деңгей

# gameOverLevel
source: Game over. Your level: {level}
kk: Ойын аяқталды. Сіздің деңгейіңіз: {level}
